tutorials/verificationAndValidation/interCondensatingEvaporatingFoam/stefanProblem/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (liquid vapour); // FC-72

liquid
{
    transportModel  Newtonian;
    nu              1e-6;
    rho             958.4;


    Cp              4216;
    Cv              4216;
    kappa           0.671;
    hf              0;
}

vapour
{
    transportModel  Newtonian;
    nu              1e-5;
    rho             0.581;


    Cp              2030;      // FC72 vapour
    Cv              2030;      // Cv = Cp - R/w
    kappa           0.025;
    hf              2260.0e3;
}

sigma 0;

Prt             0.7;

// ************************************************************************* //
